In [3]:
!pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/apple/Library/Python/3.13/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /Users/apple/Library/Python/3.13/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
!pip install numpy

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (2.1.3)

In [5]:
import numpy as np
import pandas as pd

In [6]:
obj = pd.Series ([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj[obj > 0]

0    4
1    7
3    3
dtype: int64

In [9]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year" : [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
df = pd.DataFrame(data)
print(df)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [11]:
df['year'] = 1989

In [12]:
df

    state  year  pop
0    Ohio  1989  1.5
1    Ohio  1989  1.7
2    Ohio  1989  3.6
3  Nevada  1989  2.4
4  Nevada  1989  2.9
5  Nevada  1989  3.2

In [13]:
dummy = [1,2,3,4,5,6]
df['year'] = dummy

In [14]:
df

    state  year  pop
0    Ohio     1  1.5
1    Ohio     2  1.7
2    Ohio     3  3.6
3  Nevada     4  2.4
4  Nevada     5  2.9
5  Nevada     6  3.2

In [15]:
np.arange(20)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

In [16]:
len(df)

6

In [19]:
df[['state','pop']]

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2

In [20]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [23]:
print(df.loc[[0,3,4,5]])

    state  year  pop
0    Ohio  2000  1.5
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
np.arange(16).reshape(4,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [32]:
df2 = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
df2.loc[['Ohio','Utah']]

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [37]:
print(df.loc[:,['year','pop']])

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [40]:
df2.loc[:,['two','three','four']]

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [41]:
df2.iloc[[1,3],[0,3]]

          one  four
Colorado    4     7
New York   12    15

In [42]:
df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
df2.iloc[[1,3],[0,3]]

          one  four
Colorado    4     7
New York   12    15

In [46]:
df2.loc[['Ohio','Colorado'],['one','two']]

          one  two
Ohio        0    1
Colorado    4    5

In [47]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
df[df['pop']>2]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
df[(df['pop']>2) & (df['pop']<5)]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [51]:
df['pop']<2

0     True
1     True
2    False
3    False
4    False
5    False
Name: pop, dtype: bool

In [52]:
print(df[(df['pop'] < 2) | (df['pop'] > 4)])

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [53]:
print(df.iloc[:, 1:][df['pop'] > 2])

   year  pop
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [54]:
df.loc[df['pop']>2]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [61]:
df.iloc[:, 1:][df['pop'] >2]

   year  pop
2  2002  3.6
3  2001  2.4
4  2002  2.9
5  2003  3.2

In [62]:
data = {"state": ["Ohio", "New York", "Ohio", "Nevada", "Chicago", "Califonia"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [63]:
df

       state  year  pop
0       Ohio  2000  1.5
1   New York  2001  1.7
2       Ohio  2002  3.6
3     Nevada  2001  2.4
4    Chicago  2002  2.9
5  Califonia  2003  3.2

In [65]:
[df['state'].str.contains('hi')]

[0     True
 1    False
 2     True
 3    False
 4     True
 5    False
 Name: state, dtype: bool]

In [66]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [67]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [72]:
new_df = df.drop(columns=['pop'])

In [73]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [74]:
new_df

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [75]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [76]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [89]:
new_df1 = df['pop_sq'] = df['pop'] ** 2
new = pd.DataFrame(new_df1)

In [86]:
df

    state  year  pop  pop_sq
0    Ohio  2000  1.5    2.25
1    Ohio  2001  1.7    2.89
2    Ohio  2002  3.6   12.96
3  Nevada  2001  2.4    5.76
4  Nevada  2002  2.9    8.41
5  Nevada  2003  3.2   10.24

In [91]:
new

     pop
0   2.25
1   2.89
2  12.96
3   5.76
4   8.41
5  10.24

In [92]:
df

    state  year  pop  pop_sq
0    Ohio  2000  1.5    2.25
1    Ohio  2001  1.7    2.89
2    Ohio  2002  3.6   12.96
3  Nevada  2001  2.4    5.76
4  Nevada  2002  2.9    8.41
5  Nevada  2003  3.2   10.24

In [95]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
ori_df = pd.DataFrame(data)
df = ori_df
df = df.drop(columns=['pop'])

In [96]:
df

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [97]:
ori_df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [98]:
df = ori_df.copy()

In [99]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [100]:
ori_df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [101]:
df = pd.DataFrame(np.random.standard_normal((4, 3)),
                  columns=list("bde"),
                  index=["Utah", "Ohio", "Texas", "Oregon"])

In [102]:
df

               b         d         e
Utah    0.010128  0.198131 -1.108832
Ohio    1.154237 -0.533779  1.375712
Texas  -0.861360  0.640596 -0.223697
Oregon -1.087493  0.734553 -0.097288

In [107]:
price_df = pd.read_pickle("yahoo_price.pkl")
volume_df = pd.read_pickle("yahoo_volume.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'yahoo_price.pkl'

In [110]:
price_df = pd.read_pickle("Computer Science Master Mahidol/DataScience/tips.csv")
volume_df = pd.read_pickle("Computer Science Master Mahidol/DataScience/tips.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'Computer Science Master Mahidol/DataScience/tips.csv'

In [111]:
price_df = pd.read_pickle("Computer Science Master Mahidol/DataScience/tips.csv")
volume_df = pd.read_pickle("Computer Science Master Mahidol/DataScience/tips.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'Computer Science Master Mahidol/DataScience/tips.csv'